package com.class2018071002.entity;

public enum LicenseType {

//    1.	大型客车 A1 大型载客汽车
//2.	牵引车 A2 重型、中型全挂、半挂汽车列车
//3.	城市公交车 A3 核载10人以上的城市公共汽车
//4.	中型客车 B1 中型载客汽车
//5.	大型货车 B2 重型、中型载货汽车等
//6.	小型汽车 C1 小型 、微型载客汽车等
//7.	小型自动挡汽车 C2 小型 、微型自动挡载客汽车等
//8.	低速载货汽车 C3 低速载货汽车(原四轮农用运输车)
//9.	三轮汽车 C4 三轮汽车(原三轮农用运输车)
//10.	普通三轮摩托车 D 发动机排量大于50ml的三轮摩托车
//11.	普通二轮摩托车 E 发动机排量大于50ml的二轮摩托车
//12.	轻便摩托车 F 发动机排量小于等 于50ml的摩托车
//13.	轮式自行机械车 M 轮式自行机械车
//14.	无轨电车 N 无轨电车
//15.	有轨电车 P 有轨电车

    A1,A2,A3,B1,B2,C1,C2,C3,C4,D,E,F,M,N,P;


}
